package ru.mirea.lab4_1.subtask5;

public class Test {
        public static void main(String[] args) {
            // Создаем экземпляры книг
            Book book1 = new Book("Приключения", "Иванов");
            Book book2 = new Book("Словарь", "Петров");
            Book book3 = new Book("Энциклопедия", "Сидоров");

            // Создаем экземпляры читателей
            Reader reader1 = new Reader("Иванов Иван Иванович", 12345, "Факультет физики", "01.01.1990", "+7-123-456-78-90");
            Reader reader2 = new Reader("Петров Петр Петрович", 54321, "Факультет химии", "02.02.1985", "+7-987-654-32-10");

            // Вызываем методы для взятия книг
            reader1.takeBook(3);  // Взял 3 книги
            reader1.takeBook("Приключения", "Словарь", "Энциклопедия");  // Взял книги: Приключения, Словарь, Энциклопедия
            reader1.takeBook(book1, book2, book3);  // Взял книги: Приключения (автор: Иванов), Словарь (автор: Петров), Энциклопедия (автор: Сидоров)

            reader2.takeBook(2);  // Взял 2 книги
            reader2.takeBook("Приключения", "Словарь");  // Взял книги: Приключения, Словарь
            reader2.takeBook(book1, book2);  // Взял книги: Приключения (автор: Иванов), Словарь (автор: Петров)

            // Вызываем методы для возврата книг
            reader1.returnBook(3);  // Вернул 3 книги
            reader1.returnBook("Приключения", "Словарь", "Энциклопедия");  // Вернул книги: Приключения, Словарь, Энциклопедия
            reader1.returnBook(book1, book2, book3);  // Вернул книги: Приключения (автор: Иванов), Словарь (автор: Петров), Энциклопедия (автор: Сидоров)

            reader2.returnBook(2);  // Вернул 2 книги
            reader2.returnBook("Приключения", "Словарь");  // Вернул книги: Приключения, Словарь
            reader2.returnBook(book1, book2);  // Вернул книги: Приключения (автор: Иванов), Словарь (автор: Петров)
        }
    }

